configs/runs/hidden_bench/hidden_bench_imitation_reasoning_control_10.yaml
# Standalone 10-episode reasoning run for inspecting controller response metrics,
# under the **v2** prompt and controller text (the four settings marked "v2"
# below).  v2 is an intervention, not a bug fix: it pushes directly on how much
# information an agent volunteers, which is the quantity this study measures.
# See docs/tdd/misselaneous/11082026_prompt_modifications_v2.md and section 3.9
# of docs/documentation/hidden_bench/hidden_bench_imitation.md.  Report which
# version produced any number you quote.
#
# Run this from a terminal. First enter the repository (change this path if your
# checkout lives somewhere else):
#   cd /home/cesarali/LanguageGames/MA-CC
#
# The commands below use the MA-CC Conda environment without requiring you to
# activate it. `--no-capture-output` is important: it keeps logs, progress bars,
# provider errors, and the final result path visible while the command runs.
# Make sure the repository-root .env contains POTSDAM_API_KEY and
# BASE_POTSDAM_LLM_URL before launching.
#
# 1. Check availability, pricing, request counts, and budget (no model calls):
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment preflight \
#     --config configs/runs/hidden_bench/hidden_bench_imitation_reasoning_control_10.yaml \
#     --output-dir inspection/hidden_bench_imitation_reasoning_control_10_v2_preflight
#
# 2. Run all 10 episodes with live console output:
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment run \
#     --config configs/runs/hidden_bench/hidden_bench_imitation_reasoning_control_10.yaml \
#     --output-dir results
#
# The run performs its own fresh pricing and runtime-budget checks. The optional
# --approve-preflight flag is intentionally omitted here because live pricing
# metadata currently changes the approval fingerprint between the two commands.
llm_provider:
  type: university
  model: gwdg/qwen3-30b-a3b-instruct-2507
  credentials_env: POTSDAM_API_KEY
  base_url_env: BASE_POTSDAM_LLM_URL
  # A 30B model behind a shared proxy at concurrency 10 needs well over 60s in
  # the tail.  Run ...-v2-20260840 died on exactly this: the last good call at
  # 10:56:04, the timeout at 10:57:01, 57 seconds later.  The deadline has to
  # cover generating `max_output_tokens`, not the median reply.
  timeout_seconds: 180
  max_retries: 2
  request_concurrency: 10
  temperature: 0.0
  # Sized for v2, not v1.  v2 replies cite a fact and state a vote, and the
  # private history grows every event, so they run 100-130 tokens by the tenth
  # round where v1 ran 60-80.  At 128 the focal_update JSON was truncated with
  # no closing brace, which the vote contract correctly rejects; discussion
  # turns were cut mid-sentence silently, which corrupts the disclosure
  # measurement instead of failing loudly.
  #
  # 256 is ~2x the longest observed valid reply.  Do not raise this without
  # raising timeout_seconds with it: the cap bounds how long one generation can
  # take, so a large cap converts truncation failures into timeout failures.
  # It also feeds preflight's conservative request bound, so a very large value
  # makes the budget line below stop being a real guard.
  max_output_tokens: 256
  options:
    estimated_latency_seconds: 3.0
prompt:
  schema_version: 2
  prompt_family: hidden_bench_imitation_update
  # v2 (1 of 4).  Must equal game.options.prompt_version; the run refuses to
  # start otherwise, because preflight prices whatever this section names.
  prompt_version: 2
  response_contract:
    type: hidden_bench_json_vote
    allowed_values: [West City, East Town, North Hill]
game:
  type: hidden_bench_imitation
  population_size: 4
  horizon: 30
  topology: complete
  options:
    task_set: vanilla
    task_id: evacuation_north_hill
    profile: hidden
    assignment_scheme: bijective
    dynamics_mode: reasoning
    pairing: uniform_two_distinct
    messages_per_agent: 1
    # memory_size 0 means "all of it".  Under v2 the agent finally sees its own
    # past messages in that history, which is what makes "mention something you
    # have not mentioned yet" a followable instruction (doc section 1.3).
    memory_size: 0
    allow_relay: true
    # v2 (2 of 4).  Longer replies, one new fact per turn, an explicit stated
    # vote, and a history that no longer says "partner/controller".
    prompt_version: 2
    # v2 (3 of 4), doc section 1.2 - the paper's "Informing Asymmetry" arm.
    # Set to true to tell agents information is unevenly held.  It never marks
    # *which* facts are unique; that would end the hidden-profile task.
    inform_asymmetry: false
    # doc section 1.5.  1 keeps the canonical coordination bonus, which is this
    # study's imitation coupling strength written in English.  2 removes it.
    scenario_variant: 1
    stop_on_consensus: false
    initialization:
      mode: explicit
      initial_votes: [East Town, East Town, North Hill, West City]
    classical:
      kernel: irisarri_multi_opinion
      forward_rate: 1.0
      reverse_rate: 1.0
      interaction_factor: destination_count_plus_offset
      interaction_offset: 1.0
      control_strength: 2.0
control:
  mechanism: threshold_target
  options:
    target: correct
    sensor_sample_size: 2
    policy: threshold_target
    threshold: 0.5
    # v2 (4 of 4), doc section 2.  1 announces "the external controller"; 2
    # speaks as an ordinary peer, arguing from the shared facts only, drawn
    # from a four-paraphrase bank whose ID is logged per event.
    template_version: 2
execution:
  seed: 20260840
  repetitions: 3
  parallelism: 5
  fail_fast: false
pricing:
  mode: live
  max_age_seconds: 600
  require_fresh_at_launch: true
  fallback_policy: deny
  explicit_unknown_price_override: false
budget:
  accounting_unit: proxy_accounting_unit
  system_max_cost_per_run: 50.0
  max_cost_per_run: 50.0
  max_provider_requests: 2500
  max_input_tokens: 100000000
  max_output_tokens: 1500000
  allow_unbounded_paid_requests: false
logging:
  level: INFO
  console: true
  audit: true
  # MASTER LOGGING, SWITCH 1 of 2: ON / OFF.
  comet: true
  options:
    show_metrics: true
    prompt_examples:
      # One prompt/response Markdown file for every interaction step in each
      # episode: data/episodes/<episode-id>/prompts/round_NNN.md.
      count: 20
storage:
  output_dir: results
  format: jsonl
  checkpoints: false
  overwrite: true
  wipe_and_recompute: true
analysis:
  # Run all across-episode sensing/control information channels automatically.
  # Results are written below the run directory as a human-readable table in
  # hidden_bench_imitation_analysis/information_estimates.md.
  enabled: true
  estimators:
    # The count-vector channels: the sensor and the action measured against the
    # full occupation state N_t.
    - sensing_mi
    - population_actuation_cmi
    - target_actuation_cmi
    - focal_actuation_cmi
    # The same two questions asked against the macroscopic order parameters
    # instead of N_t.  Each order parameter is recorded as the integer headcount
    # it is a strictly monotone function of, so the estimate is exactly the one
    # you would get from the float without the float-equality hazard:
    #   m_ctrl  <-> count on the controller's target option
    #   m_truth <-> count on the correct answer
    #   m_order <-> the largest count over options (consensus, whichever option)
    # These coarsen a 14-state alphabet to a 5-state one, which is the direct
    # remedy for the conditioning-slice collapse documented in
    # docs/documentation/imitation_mutual_information.md section 8.
    # Note m_ctrl_actuation_cmi is target_actuation_cmi under a second name:
    # identical by construction, kept so the order-parameter family is complete.
    - sensing_mi_m_ctrl
    - sensing_mi_m_truth
    - sensing_mi_m_order
    - m_ctrl_actuation_cmi
    - m_truth_actuation_cmi
    - m_order_actuation_cmi
  options:
    bootstrap_resamples: 1000
    null_permutations: 1000
    confidence: 0.95
    seed: 20260813
  # Upload information_estimates.md to Comet as a run asset once analysis
  # finishes. Only takes effect when logging.comet (the master switch) is on.
  comet_export: true
metrics:
  enabled: true
  # Parallel episodes have independent interaction timelines. Record their
  # metrics locally, but do not stream any per-episode series to Comet.
  comet_export: []
aggregation:
  schema_version: 1
  forward_fill: absorbing
  relabel_by_winner: false
  percentiles: [10, 50, 90]
  rolling_window: 1
  # Once all episodes finish, aggregate only the population-order trajectories
  # needed to assess consensus and target/truth alignment.
  cell_metrics:
    - m_ctrl
    - m_truth
    - m_order
    - population_action_share_per_option
    - dominant_action_share
  sweep_metrics: []
  horizons: [1]
  null_permutations: 0
observability:
  schema_version: 1
  comet:
    # -------------------------------------------------------------------
    # MASTER LOGGING, SWITCH 2 of 2: SHAPE. Only read when comet: true.
    # -------------------------------------------------------------------
    writer: master_only
    heartbeat_seconds: 20
    progress_metrics: [episodes_done]
    # Re-render the grid picture every N finished episodes. Comet's Image Panel
    # steps through same-named images, so this scrubs as an animation of the
    # grid filling in.
    grid_image_every_n_episodes: 25
    sweep_experiment: true       # false = no liveness dashboard
    # This run is a single cell, so there is no second cell to overlay it
    # against and nothing is gained by giving it its own experiment. Keep the
    # child experiments off and let the master publish everything.
    cell_reporting: master
    # Upload the locally rendered aggregate metric PNGs (m_order, m_ctrl,
    # m_truth, dominant_action_share, and the per-option share plots).
    metric_plots: true
    # One experiment for the whole run: the aggregate curves, those PNGs, and
    # the post-run information report all land on the master rather than on
    # `<run>/run` and `<run>/analysis` siblings.
experiment:
  # Renamed on the v1 -> v2 switch so this run cannot resume into, or be
  # confused with, the v1 results already under
  # results/hidden_bench_imitation/hidden-bench-imitation-reasoning-control-10/.
  name: hidden-bench-imitation-reasoning-control-10-v2
  description: Ten controlled reasoning episodes under the v2 prompt and peer-style controller text, with event and pooled response diagnostics.
  tags: [hidden-bench, imitation, reasoning, control, diagnostics, prompt-v2]